cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'caskroom/fonts'

brew 'ack'
brew 'coreutils'
brew 'go'
brew 'grc'
brew 'hub'
brew 'imagemagick'
brew 'jp2a'
brew 'jq'
brew 'libcaca', args: ['with-imlib2']
brew 'libgit2'
brew 'openssl'
brew 'node'
brew 'readline'
brew 'ruby-build'
brew 'rbenv'
brew 'roundup'
brew 'spaceman-diff'
brew 'spark'
brew 'unrar'
brew 'wget'
brew 'yarn'
brew 'youtube-dl'

cask 'xquartz'

cask '1password'
cask 'atom'
cask 'bettertouchtool'
cask 'dotnet-sdk'
cask 'google-chrome'
cask 'iterm2'
cask 'jetbrains-toolbox'
cask 'keepingyouawake'
cask 'slack'
cask 'spectacle'
cask 'spotify'
cask 'the-unarchiver'
cask 'transmission'
cask 'tower'
cask 'vlc'

cask 'font-source-code-pro'
